# vsoStateGetRot

## Description
```pascal
FUNCTION vsoStateGetRot(
				hObj           : HANDLE;
				VAR outDiffAng : REAL;
				VAR outIs3D    : BOOLEAN) : BOOLEAN;
```

```python

def vs.vsoStateGetRot(hObj):
    return (BOOLEAN, outDiffAng, outIs3D)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||
|outDiffAng|REAL||
|outIs3D|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events